OMD_EXCH/InformationRegisters/ОДМ_ЗадачиОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОДМ_ЗадачиОбмена</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Метод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОДМ_СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Попытка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МоментСтарта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МоментФиниша</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОДМ_БазыДанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерПараметры</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерРезультат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖурналСообщений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

OMD_EXCH/CommonModules/ОДМ_РегламентныеЗадания/Ext/Module.bsl
Процедура ОДМ_ОбработкаЗадач() Экспорт
	
	ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ОДМ_ОбработкаЗадач);
	
	//TODO: режем на кучу фоновых заданий по обработке разных функциональностей,
	//все что ниже к полному рефакторингу
	
	//FIXME: плохой роутер - связать
	ФоновыеЗадания.Выполнить("ОДМ_РегламентныеЗадания.ОбработкаЗаданий_Запросы",		,	"ОбработкаЗаданий_Запросы");
	ФоновыеЗадания.Выполнить("ОДМ_РегламентныеЗадания.ОбработкаЗаданий_ЗаписьОбъектов",	,	"ОбработкаЗаданий_ЗаписьОбъектов");
	//<-
	
	ОДМ_ОбменДанными.ОтправитьДанныеВБазыПолучателей();
	ОДМ_ОбменДанными.СоздатьЭлементыСправочникаИзЗадач();
	ОДМ_ОбменДанными.ПолучитьГУИДИзВнешнейБазы();
	
КонецПроцедуры

Процедура ОДМ_ОбработкаУстаревшихЗадач() Экспорт
	
	ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ОДМ_ОбработкаУстаревшихЗадач);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	т.Идентификатор КАК Идентификатор
	                      |ИЗ
	                      |	РегистрСведений.ОДМ_ЗадачиОбмена КАК т
	                      |ГДЕ
	                      |	т.ДатаСоздания < &ДатаСоздания
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	т.Идентификатор КАК Идентификатор
	                      |ИЗ
	                      |	РегистрСведений.ОДМ_ЗадачиОбмена КАК т
	                      |ГДЕ
	                      |	т.ДатаСоздания >= &ДатаСоздания
	                      |	И т.Попытка >= &Попытка
	                      |	И т.Статус В(&АктивныеСтатусы)");
	Запрос.УстановитьПараметр("ДатаСоздания",		ДатаОчисткиЗадач());
	Запрос.УстановитьПараметр("Попытка",			КоличествоПопытокНаЗадачу());
	Запрос.УстановитьПараметр("АктивныеСтатусы",	Перечисления.ОДМ_СтатусыЗадач.АктивныеСтатусы());
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ЗадачиСтарогоПериода = РезультатЗапроса[0].Выбрать();
	Пока ЗадачиСтарогоПериода.Следующий() Цикл
		Запись = РегистрыСведений.ОДМ_ЗадачиОбмена.СоздатьМенеджерЗаписи();
		Запись.Идентификатор = ЗадачиСтарогоПериода.Идентификатор;
		Запись.Удалить();
	КонецЦикла;
	
	ЗадачиПревысившиеЛимитПопыток = РезультатЗапроса[1].Выбрать();
	Пока ЗадачиПревысившиеЛимитПопыток.Следующий() Цикл
		Запись = РегистрыСведений.ОДМ_ЗадачиОбмена.СоздатьМенеджерЗаписи();
		Запись.Идентификатор = ЗадачиПревысившиеЛимитПопыток.Идентификатор;
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			Запись.Статус = Перечисления.ОДМ_СтатусыЗадач.Ошибка;
			Запись.Записать(Истина);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область СлужебныйПрограммныйИнтерфейс

//FIXME: требуется унификация - делаем примерно одно и тоже

Процедура ОбработкаЗаданий_Запросы() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	т.Идентификатор КАК Идентификатор
	                      |ИЗ
	                      |	РегистрСведений.ОДМ_ЗадачиОбмена КАК т
	                      |ГДЕ
	                      |	т.Метод = &Метод
	                      |	И т.Статус В (&АктивныеСтатусы)
	                      |	И т.Попытка < &Попытка");
	Запрос.Параметры.Вставить("Метод",				"query");
	Запрос.Параметры.Вставить("АктивныеСтатусы",	Перечисления.ОДМ_СтатусыЗадач.АктивныеСтатусы());
	Запрос.Параметры.Вставить("Попытка",			КоличествоПопытокНаЗадачу());
	Выборка = Запрос.Выполнить().Выбрать();
	
	//вставить проверку, что бы фоновых заданий не было больше X
	Пока Выборка.Следующий() Цикл
		ФоновыеЗадания.Выполнить("ОДМ_РегламентныеЗадания.ОбработкаЗадания_ВыполнитьЗапрос", Выборка.Идентификатор, Выборка.Идентификатор);
	КонецЦикла;
	
КонецПроцедуры // СлужебныйПрограммныйИнтерфейс

Процедура ОбработкаЗаданий_ЗаписьОбъектов() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	т.Идентификатор КАК Идентификатор
	                      |ИЗ
	                      |	РегистрСведений.ОДМ_ЗадачиОбмена КАК т
	                      |ГДЕ
	                      |	т.Метод = &Метод
	                      |	И т.Статус В (&АктивныеСтатусы)
	                      |	И т.Попытка < &Попытка");
	Запрос.Параметры.Вставить("Метод",				"objectPOST");
	Запрос.Параметры.Вставить("АктивныеСтатусы",	Перечисления.ОДМ_СтатусыЗадач.АктивныеСтатусы());
	Запрос.Параметры.Вставить("Попытка",			КоличествоПопытокНаЗадачу());
	Выборка = Запрос.Выполнить().Выбрать();
	
	//вставить проверку, что бы фоновых заданий не было больше X
	Пока Выборка.Следующий() Цикл
		ФоновыеЗадания.Выполнить("ОДМ_РегламентныеЗадания.ОбработкаЗадания_ВыполнитьСериализациюОбъекта", Выборка.Идентификатор, Выборка.Идентификатор);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗадания_ВыполнитьЗапрос(Знач Идентификатор) Экспорт
	
	Задача = РегистрыСведений.ОДМ_ЗадачиОбмена.ДанныеЗадачи(Идентификатор);
	ОДМ_ОбменДанными.ВыполнитьЗапрос(Задача);
	
КонецПроцедуры

Процедура ОбработкаЗадания_ВыполнитьСериализациюОбъекта(Знач Идентификатор) Экспорт
	
	Задача = РегистрыСведений.ОДМ_ЗадачиОбмена.ДанныеЗадачи(Идентификатор);
	ОДМ_ОбменДанными.ЗаписатьОбъект(Задача);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КоличествоПопытокНаЗадачу()
	
	Возврат 5;
	
КонецФункции

Функция ДатаОчисткиЗадач()
	
	Возврат ТекущаяДатаСеанса() - 30*24*60*60;
	
КонецФункции

#Область РазныеОбертки

Процедура ПриНачалеВыполненияРегламентногоЗадания(Знач РегламентноеЗадание)
	
	ОбщийМодуль_ОбщегоНазначения = ОДМ_ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначения");
	Если НЕ ОбщийМодуль_ОбщегоНазначения = Неопределено Тогда
		ОбщийМодуль_ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(РегламентноеЗадание);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // РазныеОбертки

#КонецОбласти // СлужебныеПроцедурыИФункции
